app/Controllers/CustomerController.php

	public function appointments()
	{
		if (!$this->session->isLoggedIn) {
			return view('customer/login', [
				'userData' => $this->session->userData,
				'page_name' => 'service_station_login',

			]);
		}
 		$ServiceStationModel = new ServiceStationModel();

 		$services= new ServiceCatModel();

 		$sessionData=$this->session->ownerData;

		$service_station = $ServiceStationModel->findAll();

		$vehicles = new vehicleModel();

		$owner_data=$this->session->ownerData;

		$owner_id  = $owner_data['id'];

		$station_id=$this->request->uri->getSegment(2);

		$my_vehicles = $vehicles->getMyVehicles($owner_id);

		$station_services = $services->getStationServices($station_id);

		$station = $ServiceStationModel->where('station_id', $station_id)->first();
---
SELECT *
FROM `service_stations`
SELECT *
FROM `service_stations`
WHERE `station_id` = '36'
 LIMIT 1

	public function appointments_submit(){

		$appointmentsModel = new appointmentsModel();

		$data = [
            'station_id'          	=> $this->request->getPost('station_id'),
            'cat_id'          	    => $this->request->getPost('service'),
            'vehicle_id'         	=> $this->request->getPost('vehicle'),
            'request_date'     		=> $this->request->getPost('request_date'),
            'time_slot'          	=> $this->request->getPost('time_slot'),
            'owner_id'          	=> $this->request->getPost('owner_id'),

        ];

        if (! $appointmentsModel->save($data)) {
---
INSERT INTO `appointments` (`station_id`, `cat_id`, `vehicle_id`, `request_date`, `time_slot`, `owner_id`) VALUES ('36', '5', '15', '2023-01-13', '11:00', '14')

	public function attemptLogin()
	{
		// validate request
		$rules = [
			'email'		=> 'required|valid_email',
			'password' 	=> 'required|min_length[5]',
		];

		if (! $this->validate($rules)) {
			return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
		}

		// check credentials
		$stations = new ServiceStationModel();

		$station = $stations->where('email', $this->request->getPost('email'))->first();

		$owners = new vehicle_ownersModel();

		$owner = $owners->where('email', $this->request->getPost('email'))->first();

		$users = new UserModel();

		$user = $users->where('email', $this->request->getPost('email'))->first();
---
SELECT *
FROM `service_stations`
WHERE `email` = 'abc@gmail.com'
 LIMIT 1
SELECT *
FROM `users`
WHERE `email` = 'abc@gmail.com'
 LIMIT 1