app/Controllers/StationController.php

	public function ap_accept(){

		$id = $this->request->uri->getSegment(2);
		$appointmentsModel = new appointmentsModel();

		$data = [
			'id'  	=> $id,
			'status'  	=> 2,
		];

		if (! $appointmentsModel->save($data)) {
---
UPDATE `appointments` SET `id` = '20', `status` = 2
WHERE `appointments`.`id` IN ('20')

	public function ap_susp(){

		$id = $this->request->uri->getSegment(2);
		$appointmentsModel = new appointmentsModel();

		$data = [
			'id'  	=> $id,
			'status'  	=> 4,
		];

		if (! $appointmentsModel->save($data)) {
---
UPDATE `appointments` SET `id` = '21', `status` = 4
WHERE `appointments`.`id` IN ('21')

	public function service_station()
	{
		$service_station = new ServiceStationModel();
		// getall users
		$all_service_station = $service_station->findAll();
---
SELECT *
FROM `service_stations`

	public function service_station_details(){

		$station_id = $this->request->uri->getSegment(2);
		$ServiceStationModel = new ServiceStationModel();
		$categories = new ServiceCatModel();

		$allcategory = $categories->findAll();

		$data = $ServiceStationModel->where('station_id', $station_id)->first();
---
SELECT *
FROM `service_stations`
WHERE `station_id` = '36'
 LIMIT 1